Repository: common-repository/template-seo-checker
Catalog: lang/template-seo-checker-*.po
Languages: es_es

source: My name is <strong>Jonatan Jumbert</strong>, I am SEO professional and a web developer who enjoys to take on new projects. If do you want know more about me you can check out my <a href="https://plus.google.com/u/0/+JonatanJumbert/posts" titlte="Author Google+ profile" target="_blank">Google+ profile</a> or me <a href="http://jonatanjumbert.com?utm_source=Wordpress&utm_medium=Plugin&utm_term=Template%20SEO%20Checker&utm_campaign=Wordpress%20plugins" target="_blank" title="Author site">personal site</a>.
es_es: Me llamo <strong>Jonatan Jumbert</strong>, soy un profesional SEO, desarrollador web y amante del márketing digital que le encanta participar en nuevos proyectos. Si quieres saber más sobre mi, no dudes en darle un vistazo a mi perfil de <a href="https://plus.google.com/u/0/+JonatanJumbert/posts" titlte="Perfil de Jonatan Jumbert" target="_blank">Google+</a> o en <a href="http://jonatanjumbert.com?utm_source=Wordpress&utm_medium=Plugin&utm_term=Template%20SEO%20Checker&utm_campaign=Wordpress%20plugins" target="_blank" title="Página web personal">mi sitio web personal</a>.

source: Do you wanna hire me?
es_es: ¿Quieres contratarme?

source: Make a donation
es_es: Haz un donación

source: Do you like this plugin? Why don't contribute with a little donation?
es_es: ¿Te gusta el plugin? ¿Porqué no contribuyes con una pequeña donación?

source: Make author happy and pay him something
es_es: Haz feliz al autor e invítale a algo

source: Pay a coffee - 1&euro;
es_es: Un café - 1,00&euro;

source: Pay a beer - 2&euro;
es_es: Una cerveza - 2,00&euro;

source: Pay a snack - 3&euro;
es_es: Unas bravas - 3,00&euro;

source: Pay a drink - 5&euro;
es_es: Una copa - 5,00&euro;

source: Pay the cinema - 10&euro;
es_es: Un cine - 10,00&euro;

source: PayPal - The safer, easier way to pay online.
es_es: Paypal - La manera más segura y fácil de pagar online.

source: You can follow me on
es_es: Me puedes seguir en

source: View Jonatan Jumbert's personal blog
es_es: Ver el blog personal de Jonatan Jumbert

source: Follow me on my blog
es_es: Visita mi blog

source: View Jonatan Jumbert's Google+ profile
es_es: Ver el perfil de Google+ de Jonatan Jumbert

source: Follow me on Google+
es_es: Sígueme en Google+

source: View Jonatan Jumbert's Linkedin profile
es_es: Ver el perfil en Linkedin de Jonatan Jumbert

source: Follow me on Linkedin
es_es: Sígueme en Linkedin

source: View Jonatan Jumbert's Twitter profile
es_es: Ver el perfil en Twitter de Jonatan Jumbert

source: Follow me on Twitter
es_es: Sígueme en Twitter

source: View Jonatan Jumbert's Facebook profile
es_es: Ver el perfil en Facebook de Jonatan Jumbert

source: Follow me on Facebook
es_es: Sígueme en Facebook

source: No urls have been checked yet
es_es: No se ha comprobado ningua URL todavía

source: Template SEO score
es_es: Puntuación SEO de la plantilla

source: Recalc SEO score for current wordpress template
es_es: Recalcular la puntuación SEO de la plantilla actual

source: No SEO friendly
es_es: No optimizada para SEO

source: Your template looks like trash speaking in SEO terms.
es_es: Parece que tu plantilla es un auténtico desastre en hablando en términos SEO.

source: I hope you did not pay for this theme. Because it's not SEO friendly and a lot of things can be done better.
es_es: Espero que no hayas pagado ni un euro por esta plantilla. Porqué no está para nada optimizada en términos SEO ya que muchas cosas se pueden mejorar y corregir.

source: It could be better
es_es: Podría estar mejor

source: Your template it's not all SEO frendly as it could be.
es_es: Tu plantilla no está todo lo optimizada para SEO que podría estar.

source: Nice! Your template is SEO friendly
es_es: Bien! Tu plantilla está optimizada para SEO.

source: Nice! Your template is SEO friendly.
es_es: Bien! Tu plantilla está optimizada para SEO.

source: Well done! Your template is SEO friendly. But, you should take care about some points because you can improve even more you SEO onsite.
es_es: ¡Genial! Tu plantilla esta optimizada para SEO. Pero, deberías tener en cuenta algunos factores porqué puedes mejorar aún más tu SEO On page.

source: Awesome! Your template is ready for SEO
es_es: ¡Increíble! Tu plantilla esta optimizada para SEO

source: Absolutely awesome! Your SEO onsite looks perfect.
es_es: Fantástico! El SEO On page de tu web está perfecto.

source: Absolutely awesome! Seems like your template is ready for SEO. Your SEO onsite looks perfect. Don't forget check all urls as you can in order to have accurate results.
es_es: ¡Tremendamente bien! Parece que tu plantilla de Wordpress está optimizada para SEO. El SEO On page de tu web está perfecto, pero no olvides comprobar todas las URL que puedas para tener unos resultados más precisos.

source: Last time checked on
es_es: Última comprobación el

source: Report based on <strong>%s</strong> urls checked
es_es: Informe basado en <strong>%s</strong> urls comprobadas

source: homepage
es_es: Página principal

source: Is your homepage good enough for SEO?
es_es: ¿Tu página principal esta optimizada para SEO?

source: Test date
es_es: Fecha de comprobación

source: SEO Score
es_es: Puntuación SEO

source: Improvement
es_es: Mejora

source: No tested yet
es_es: Aún no se ha comprobado

source: Recalc SEO score for your homepage template
es_es: Recalcular puntuación SEO para la página principal de la plantilla

source: Comments
es_es: Comentarios

source: SEO Summary for:
es_es: Resumen SEO para:

source: Looks like <strong>your template is blocking access to robots</strong>. Your page won't be indexed at Google. No one will see your page at <abbr title="Search Engine Result Pages">SERP</abbr> when searches something at Google that you wrote about.
es_es: Parece que <strong>estás bloqueando el acceso a los robots de los buscadores para que no indexen tu página</strong>. Como resultado, nadie verá aparecer tu página en los buscadores cuando busque algo sobre lo que escribes.

source: <strong>Perfect</strong>! no inline styles were found at current URL.
es_es: ¡<strong>Perfecto</strong>! No he encontrado ningún estilo en línea en la URL que acabas de analizar.

source: <strong>Well!</strong> a few inline styles were found at current URL.
es_es: <strong>¡Vaya!</strong> parece que en la página que acabas de analizar aparece algún que otro estilo en línea.

source: <strong>Oops!</strong> there were found inline styles at current URL. To optimize your page try to include these styles in your CSS.
es_es: <strong>OOppps!</strong> parece que la página analizada usa unos cuantos estilos en línea. Para optimizar trata de incluir estos estilos en tus CSS.

source: <strong>Ooppps!</strong> too much inline styles found at current URL.To optimize your page try to include these styles in your CSS.
es_es: <strong>OOoopppps!</strong> demasiados estilos en línea existen en la URL actual. Para optimizar trata de incluir estos estilos en tus CSS.

source: That's <strong>Incredible!</strong> Do you know about CSS? Your current URL is full of inline styles. You must put it on external CSS files, please do it.
es_es: ¡<strong>Me parece increíble</strong>! ¿Sabes algo de CSS? Lo digo porqué la URL que se acaba de analizar esta repleta de estilos en línea (eso es malo). Debes incluirlos en un fichero externo de CSS, por favor... hazlo!

source: <strong>%d</strong> &lt;h1&gt; tags were found.
es_es: Se han encontrado <strong>%d</strong> &lt;h1&gt;.

source: <strong>%d</strong> &lt;h2&gt; tags were found.
es_es: Se han encontrado <strong>%d</strong> &lt;h2&gt;.

source: <strong>%d</strong> &lt;h3&gt; tags were found.
es_es: Se han encontrado <strong>%d</strong> &lt;h3&gt;.

source: <strong>%d</strong> &lt;h4&gt; tags were found.
es_es: Se han encontrado <strong>%d</strong> &lt;h4&gt;.

source: <strong>%d</strong> &lt;h5&gt; tags were found.
es_es: Se han encontrado <strong>%d</strong> &lt;h5&gt;.

source: <strong>%d</strong> &lt;h6&gt; tags were found.
es_es: Se han encontrado <strong>%d</strong> &lt;h6&gt;.

source: Current page's doctype is not HTML5, this means that your page can't have more than &lt;h1&gt; tag. Please, fix it.
es_es: El doctype de la página actual no está definido en HTML5 y por lo tanto no puede haber más de un &lt;h1&gt;. Por favor, corrígelo.

source: No &lt;h1&gt; tag was found at current URL.
es_es: No se ha definido ningún &lt;h1&gt; para la URL actual.

source: No heading tags were found at current URL. You can check the importance of these tags at <a href="wp-admin/admin.php?page=template-seo-checker&viewfaq=1">FAQ page</a>.
es_es: No se han encontrado etiquetas de encabezado en la URL actual. Puedes descubrir la importancia de estas etiquetas en la página de <a href="wp-admin/admin.php?page=template-seo-checker&viewfaq=1">preguntas frecuentes</a>.

source: Excessive number of &lt;h2&gt; tags were found.
es_es: Se ha encontrado un número excesivo de etiquetas &lt;h2&gt;.

source: Excessive number of &lt;h3&gt; tags were found.
es_es: Se ha encontrado un número excesivo de etiquetas &lt;h3&gt;.

source: Excessive number of heading tags were found.
es_es: Se ha encontrado un uso excesivo de etiquetas de encabezado.

source: Check your headings tags for current URL, you're including tags in wrong order (for example you are using &lt;h5&gt; without using &lt;h4&gt;)
es_es: Verifica las etiquetas de encabezado para la URL actual, estás usando etiquetas en orden incorrecto (por ejemplo estás usando &lt;h5&gt; sin usar &lt;h4&gt;)

source: Perfect, the size in Kb of images for current URL is lower than 150Kb.
es_es: Perfecto, el tamaño en Kb de las imágenes de la URL actual está por debajo de 150Kb.

source: The size in Kb of images for current URL it's pretty good.
es_es: El tamaño en Kb de las imágenes de la URL actual es bastante bueno.

source: The size in Kb of images for current URL it's above 500Kb. Try to reduce it.
es_es: El tamaño en Kb de las imágenes de la URL actual está por encima de los 500Kb. Trata de reducir el peso de tus imágenes.

source: The size in Kb of images for current URL it's above 800Kb. Try to reduce it, your SEO score can be affected.
es_es: El tamaño en Kb de las imágenes de la URL actual está por encima de los 800Kb. Trata de reducir el peso de tus imágenes, la puntuación SEO de esta página se verá gravemente afectada.

source: Your theme is including five CSS files. Can you reduce it?
es_es: Tu plantilla está incluyendo hasta 5 ficheros CSS. ¿Puedes reducirlo?

source: Your theme is including 6-8 CSS files. Can you reduce it?
es_es: Tu plantilla está incluyendo entre 6 y 8 ficheros CSS. ¿Puedes reducirlo?

source: Your theme is including too much CSS files. Are you using too many plugins maybe?
es_es: Tu plantilla está incluyendo demasiados ficheros CSS. ¿Tal vez estás usando demasiados plugins?

source: Your theme is including insane amount of CSS files. Fix it now.
es_es: Tu plantilla está usando una cantidad brutal de ficheros CSS. Deberías corregir esto inmediatamente.

source: Your teme is including five JS files. Can you reduce it?
es_es: Tu plantilla está incluyendo hasta 5 ficheros JS. ¿Puedes reducirlo?

source: Your theme is including 6-8 JS files. Can you reduce it?
es_es: Tu plantilla está incluyendo entre 6 y 8 ficheros JS. ¿Puedes reducirlo?

source: Your theme is including too much JS files. Are you using too many plugins maybe?
es_es: Tu plantilla está incluyendo demasiados ficheros JS. ¿Tal vez estás usando demasiados plugins?

source: Your theme is including insane amount of JS files. Fix it now.
es_es: Tu plantilla está usando una cantidad brutal de ficheros JS. Deberías corregir esto inmediatamente.

source: Your theme has not &lt;title&gt; tag or is empty.
es_es: Tu plantilla no tiene etiqueta &lt;title&gt; o esta está vacía.

source: Your &lt;title&gt; tag is too short.
es_es: La etiqueta &lt;title&gt; es demasiado corta.

source: Your &lt;title&gt; tag is too long.
es_es: La etiqueta &lt;title&gt; es demasiado larga.

source: Meta name description tag is empty.
es_es: La etiqueta meta name description está vacía.

source: Meta name description tag is too short.
es_es: La etiqueta meta name description es demasiado corta.

source: Meta name description tag is too long.
es_es: La etiqueta meta name description es demasiado larga.

source: Perfect, the size in Kb of CSS files for current URL is lower than 150Kb.
es_es: Perfecto, el tamaño en Kb de los ficheros CSS de la URL actual está por debajo de 150Kb.

source: The size in Kb of CSS files for current URL it's pretty good.
es_es: El tamaño en Kb de los ficheros CSS de la URL actual es bastante bueno.

source: The size in Kb of CSS files for current URL it's above 500Kb. Try to reduce it.
es_es: El tamaño en Kb de los ficheros CSS de la URL actual está por encima de los 500Kb. Trata de reducir el peso de tus CSS.

source: The size in Kb of CSS files for current URL it's above 800Kb. Try to reduce it, your SEO score can be affected.
es_es: El tamaño en Kb de los ficheros CSS de la URL actual está por encima de los 800Kb. Trata de reducir el peso de tus CSS, la puntuación SEO de esta página se verá gravemente afectada.

source: Perfect, the size in Kb of JS files for current URL is lower than 150Kb.
es_es: Perfecto, el tamaño en Kb de los ficheros JS de la URL actual está por debajo de 150Kb.

source: The size in Kb of JS files for current URL it's pretty good.
es_es: El tamaño en Kb de los ficheros JS de la URL actual es bastante bueno.

source: The size in Kb of JS files for current URL it's above 500Kb. Try to reduce it.
es_es: El tamaño en Kb de los ficheros JS de la URL actual está por encima de los 500Kb. Trata de reducir el peso de tus javascripts.

source: The size in Kb of JS files for current URL it's above 800Kb. Try to reduce it, your SEO score can be affected.
es_es: El tamaño en Kb de los ficheros JS de la URL actual está por encima de los 800Kb. Trata de reducir el peso de tus javascripts, la puntuación SEO de esta página se verá gravemente afectada.

source: Perfect, no links without title were found.
es_es: Perfecto, no se han encontrado enlaces sin el atributo title.

source: Pretty good, just a few links without title were found.
es_es: Bastante bien, unos pocos enlaces no tienen el atributo title.

source: A few number of links without title were found. Try to fix it to improve your SEO score.
es_es: He encontrado algunos enlaces que no implementan el atributo title. Arregla esto para mejorar tu puntuación SEO.

source: You should include attribute title for all your links to get a best SEO score.
es_es: Deberías incluir el atributo title para todos tus enlaces para obtener una mejor puntuación SEO.

source: You must include attribute title for all your links. You can rank better if you do.
es_es: Tienes que incluir el atributo title a todos tus enlaces. Si lo haces posicionarás mejor.

source: Perfect, no images without alt were found.
es_es: Perfecto, no se han encontrado imágenes sin el atributo alt.

source: Pretty good, just a few images without alt were found.
es_es: Bastante bien, unas pocas imágenes no tienen el atributo alt.

source: A few number of images without alt were found. Try to fix it to improve your SEO score.
es_es: He encontrado algunas imágenes que no implementan el atributo alt. Arregla esto para mejorar tu puntuación SEO.

source: You should include attribute alt for all your images to get a best SEO score.
es_es: Deberías incluir el atributo alt para todas tus imágenes para obtener una mejor puntuación SEO.

source: You must include attribute alt for all your images. You can rank better if you do.
es_es: Tienes que incluir el atributo alt a todas tus imágenes. Si lo haces posicionarás mejor.

source: Perfect, no images without height and width attributes were found.
es_es: Perfecto, no se han encontrado imágenes sin los atributos height y width.

source: Pretty good, just a few images without alt height and width attributes found.
es_es: Bastante bien, unas pocas imágenes no tienen el atributo height ni width.

source: A few number of images without height and width attributes were found. Try to fix it to improve your SEO score.
es_es: He encontrado algunas imágenes que no implementan el atributo height ni width. Arregla esto para mejorar tu puntuación SEO.

source: You should include attribute height and width attributes for all your images to get a best SEO score.
es_es: Deberías incluir el atributo height y width para todas tus imágenes para obtener una mejor puntuación SEO.

source: You must include attribute height and width for all your images. You can rank better if you do.
es_es: Tienes que incluir el atributo height y width a todas tus imágenes. Si lo haces posicionarás mejor.

source: View SEO summary
es_es: Ver el resumen SEO

source: Recalc SEO score for current URL
es_es: Recalcular puntuación SEO para esta URL
