Repository: common-repository/template-seo-checker
Catalog: lang/template-seo-checker-*.po
Languages: es_es

source: <strong>Template SEO Checker</strong> need <a href="http://se1.php.net/manual/en/book.curl.php" target="_blank">CURL library</a> to work.
es_es: <strong>Template SEO Checker</strong> necesita la <a href="http://se1.php.net/manual/es/book.curl.php" target="_blank">librería CURL</a> para funcionar.

source: Inline styles
es_es: Estilos en línea

source: Responsive ready
es_es: Web responisbe (diseño adaptable)

source: Headings evaluation
es_es: Evaluación de las cabeceras

source: Images size
es_es: Tamaño de las imágenes

source: Number of CSS
es_es: Número de ficheros CSS

source: Number of JS
es_es: Número de ficheros JS

source: Title
es_es: Título

source: Description
es_es: Descripción

source: CSS size
es_es: Tamaño de los CSS

source: JS size
es_es: Tamaño de los CSS

source: Links without title
es_es: Enlaces sin el atributo title

source: Images without alt
es_es: Imágenes sin el atributo alt

source: DOM elements
es_es: Número de elementos del DOM

source: HTML5 ready
es_es: Plantilla lista para HTML5

source: Images without height and width
es_es: Imágenes sin especificar medidas

source: CSS for print
es_es: CSS para impresión

source: Summary
es_es: Resumen

source: FAQ: Frequent Asked Questions
es_es: FAQ: Preguntas Frecuentes

source: Frequent Asked Questions
es_es: Preguntas Frecuentes

source: Is your Wordpress Template good enough for SEO?
es_es: ¿Esta tu plantilla de Wordpress optimizada para SEO?

source: Why is important that my wordpress template is SEO ready?
es_es: ¿Porqué es importante tener una plantilla de Wordpress optimizada para SEO?

source: If you have been installed this plugin, it is possible that you already know the answer. There are two big areas in the <abbr title="Search Engine Optimization">SEO</abbr> world, the <abbr title="Search Engine Optimization">SEO</abbr> Off page (link building, social media, domain authority...) and <abbr title="Search Engine Optimization">SEO</abbr> On page (website faster, optimized, HTML5 ready, with rich snippets, etc). <br /><br />This plugin, tries to help you to optimize your <abbr title="Search Engine Optimization">SEO</abbr> On page by telling you which things you could change in order to improve your ranking at <abbr title="Search Engine Result Pages">SERP</abbr>. Because you should never forget that if your website ranks better than other, more visits you will have and more money will you earn. (because all this is about the money, isn't it?)
es_es: Si has instalado tú mismo este plugin, muy probablemente sepas la respuesta. En <abbr title="Search Engine Optimization">SEO</abbr> hay dos grandes areas de optimización, el <abbr title="Search Engine Optimization">SEO</abbr> Off page (Construcción de enlaces, redes sociales, autoridad del dominio, etc.) y el <abbr title="Search Engine Optimization">SEO</abbr> On page (tener una web rápida, optimizada, desarrollado con HTML5, implementación de Rich Snippets, etc.)<br /><br />Este plugin, te ayudará a optimizar tu <abbr title="Search Engine Optimization">SEO</abbr> On page, diciéndote las cosas que podrías cambiar para mejorar tu posición en el ranking de las páginas de resultados de los buscadores. Nunca debes olvidar que si un sitio web posiciona mejor que otro, obtendrá más visitas y muy probablemente generará más dinero. (¿Porque todo se basa en ganar dinero, no?)

source: Can you explain me in more deep every SEO factor?
es_es: ¿Podrías explicar con más detalle cada factor <abbr title="Search Engine Optimization">SEO</abbr>?

source: Sure, let's see...
es_es: ¡Claro que si! Vamos al lío...

source: The most important factor that plugin check is <strong>meta name="robots"</strong>. If your theme has it enabled and current value is <strong>"noindex"</strong> your URL score will be <strong>0/100</strong>, because you are telling Google's robot and robots from other search engines that you don't want that your url will be indexed on Search Engines, so... your theme is not <abbr title="Search Engine Optimization">SEO</abbr> friendly.
es_es: El factor <abbr title="Search Engine Optimization">SEO</abbr> más importante que comprueba este plugin es la etiqueta <strong>meta name="robots"</strong>. Si tu template la tiene en su código fuente y su valor es <strong>"noindex"</strong> la puntuación <abbr title="Search Engine Optimization">SEO</abbr> de esa URL será de <strong>0/100</strong>, porqué le estarás diciendo al robot de Google y otros robots de otros buscadores que no quieres que esta URL sea indexada (aparezca) en las páginas de resultados de los buscadores, así... que tu plantilla no estará para nada optimizada para <abbr title="Search Engine Optimization">SEO</abbr>.

source: Next factor is determine if your theme uses <strong>inline styles</strong>. Why you should avoid inline styles? First because <strong>it's a bad practice</strong> speaking in terms of web development (you should use external <abbr title="Cascading Style Sheets">CSS</abbr>). Second because your code will be dirty and the final size of current URL will be higher, and this affects <abbr title="Search Engine Optimization">SEO</abbr> in terms of <abbr title="Web Performance Optimization">WPO</abbr>. Sites who load faster than other will be rank better in <abbr title="Search Engine Result Pages">SERP</abbr> (<strong>page speed its an important factor on Google search engine algorithm</strong>).
es_es: El siguiente factor es comprobar si tu plantilla hace uso de <strong>estilos en línea</strong>. ¿Porqué debería evitar el uso de estilos en línea? Primero de todo <strong>porqué es una mala práctica</strong> hablando en términos de desarrollo web (deberías hacer uso de <abbr title="Cascading Style Sheets">CSS</abbr> externos). En segundo lugar, porqué estarás ensuciando el código fuente de tú página y haciendo que el tamaño final en Kb de esta URL sea mayor, cosa que afecta al <abbr title="Search Engine Optimization">SEO</abbr> en termas de <abbr title="Web Performance Optimization">WPO</abbr>. Por norma general, sitios que cargan más rápido que otros, posicionan mejor en las <abbr title="Search Engine Result Pages">SERP</abbr> (<strong>la velocidad de carga es un factor importante del algoritmo de búsqueda de Google</strong>).

source: Be <strong>responsive ready</strong> is next factor I will check in your themes. A responsive site is better than others no responsive or others who serves same content in different URL in terms of <abbr title="Search Engine Optimization">SEO</abbr>. In fact, if you use a different domain or subdomain for mobile users like mobile.domain.com or something like that you probably will be penalized by Google Panda update, so be carefully.
es_es: Tener una plantilla <strong>responsive o de diseño adaptable</strong> es el siguiente factor que tendremos en cuenta. Un sitio web responsive es mejor que aquellos que no lo son o aquellos que sirven el mismo contenido desde diferentes URLS (hablando siempre en términos de <abbr title="Search Engine Optimization">SEO</abbr>). De hecho, si usas un dominio diferente o un subdominio para los usuarios que accedan a tu web desde dispositivos móviles como m.dominio.com o algo parecido, muy probablemente seas penalizado para la actualización del algoritmo de Google Panda, así que ándate con ojo.

source: <strong>Headings evalutation</strong>. Do you know that exist <abbr title="HyperText Markup Language">HTML</abbr> tags like &lt;h1&gt;, &lt;h2&gt;, &lt;h3&gt;, &lt;h4&gt;, &lt;h5&gt; and &lt;h6&gt;? And these tags are used to tell search engines what is your page talking about? You should use them with wisdom. Every page should have a different &lt;h1&gt;. Heading tags are used to define the headings in your page.
es_es: <strong>Evaluación de etiquetas de cabecera</strong>. ¿Sabes que existen etiquetas <abbr title="HyperText Markup Language">HTML</abbr> cómo &lt;h1&gt;, &lt;h2&gt;, &lt;h3&gt;, &lt;h4&gt;, &lt;h5&gt; and &lt;h6&gt; y que se utilizan para decirle a los buscadores sobre que trata tu página? Debes usar estas etiquetas con sabiduría. Cada página debe tener un único &lt;h1&gt;. Las etiquetas de cabecera definen los encabezados (títulos y subtítulos) de tu página.

source: The <strong>size in Kb of images used in your theme is important</strong> in terms of <abbr title="Web Performance Optimization">WPO</abbr> (page speed). If your site includes a lot of pics you should try to optimize those pics to do your page load faster.
es_es: El <strong>tamaño en Kb que pesan las imágenes usadas en tu plantilla también es muy importante</strong> para la optimización del rendimiento de tu web (<abbr title="Web Performance Optimization">WPO</abbr> o velocidad de carga). Si tu página incluye muchas imágenes deberás tratar que estas estén optimizadas y que ocupen lo mínimo necesario para que tu página cargue lo más rápido posible.

source: If your theme uses a lot of <abbr title="Cascading Style Sheets">CSS</abbr> files you should try to unify all in just one or two external <abbr title="Cascading Style Sheets">CSS</abbr>. This is important because a <strong>fewer number of <abbr title="Cascading Style Sheets">CSS</abbr> can be loaded with fewer server requests</strong>. This will help to make your site load faster.
es_es: Si tu plantilla usa muchos ficheros <abbr title="Cascading Style Sheets">CSS</abbr> deberás tratar de unificarlos todos en uno o un par de ficheros. Esto es importante porqué así <strong>conseguirás un número inferior de peticiones al servidor</strong>. Esto ayudará a hacer que tu sitio o página web cargue mucho más rápido.

source: Same as happen with number of <abbr title="Cascading Style Sheets">CSS</abbr> applies to <strong>number of JS</strong> that your theme is using. Try to unify all of them in just on file and include them at the bottom of the <abbr title="HyperText Markup Language">HTML</abbr> code, before &lt;/body&gt; tag.
es_es: Lo mismo que ocurre con el número de ficheros <abbr title="Cascading Style Sheets">CSS</abbr> aplica al <strong>número de ficheros JS</strong> que tu plantilla está usando. Intenta unificarlos todos ellos en único fichero e incluirlo al final del código <abbr title="HyperText Markup Language">HTML</abbr> justo antes de la etiqueta de cierre &lt;/body&gt;.

source: All your URLs should have <strong>a different title tag</strong>. &lt;title&gt; tag is defined at head section of your <abbr title="HyperText Markup Language">HTML</abbr> code and it's important because besides telling search engines what is talking about your page, this title is displayed as snippet in <abbr title="Search Engine Result Pages">SERP</abbr>.
es_es: Todas tus páginas deben tener un <strong>título único</strong>. La etiqueta &lt;title&gt; se define en la sección head de tú código <abbr title="HyperText Markup Language">HTML</abbr> y es importante porqué además de decirle a los buscadores sobre que habla tu página, es el título que se muestra como snippet en las <abbr title="Search Engine Result Pages">SERP</abbr>.

source: Your template should also have a <strong>description</strong> meta tag. This description is displayed in same snippet like title. And its important because tells users what they will find if they click on your result.
es_es: Tu plantilla también debe tener un meta tag <strong>description</strong>. Esta descripción se muestra en el mismo snippet que el título y es importante porqué le dice a los usuarios lo que encontrarán si hacen click en el resultado de busqueda cuando accedan a tu página.

source: I talked before about the importance of reduce your image files size, and now its time to <strong>reduce the size in Kb of your <abbr title="Cascading Style Sheets">css</abbr> files</strong>. You should only include necessary styles for your current theme if you want to be faster than your competitors.
es_es: Anteriormente he hablado de la importancia de reducir el tamaño de las imágenes y ahora es el momento de <strong>reducir el tamaño en Kb de tus archivos <abbr title="Cascading Style Sheets">css</abbr></strong>. Únicamente deberías incluir los estilos necesarios para la plantilla actual si quieres que tu página cargue tan rápida cómo la de tu competencia.

source: The same applies to your <strong>javascript files size</strong>. You should reduce it as far as you can to <strong>improve your page load speed</strong>.
es_es: Lo mismo aplica al <strong>tamaño de los archivos javascript</strong>. Deberás reducirlos tanto como puedas para <strong>mejorar el tiempo de carga de tu plantilla</strong>.

source: Another important point that you may take a look is if <strong>all your links have a comprehensive and detailed title attribute</strong>. This attribute indicates to google bot and users what they will find if they click this link. It would be nice if you take the advantage to put your main keywords there.
es_es: Otro punto importante que hay que tener en cuenta es si <strong>todos tus enlaces tienen el atributo title y si este ofrece una descripción detallada</strong>. Este atributo le indica al roboto de Google y a los usuarios lo que encontrarán después de hacer click en el enlace. Estaría bien que te adelantaras y colocaras aquí alguna de tus keywords.

source: Same as title attribute for links applies to alt attribute for images. You should never forget put <strong>a comprenhensive and detailed description of current image on alt attribute</strong>.
es_es: Lo mismo que el atributo title de los enlaces aplica al atributo alt para las imágenes. No deberías olvidar nunca <strong>implementar el atributo alt para todas las imágenes</strong> así mejorarás el <abbr title="Search Engine Optimization">SEO</abbr> de tu página y probablemente aparezcas en búsquedas de imágenes.

source: <strong>The number of <abbr title="Document Object Model">DOM</abbr></strong> elements is also important to determine your <abbr title="Search Engine Optimization">SEO</abbr> On page. Generally a lower number indicates your template is better (but this depends on how many news, articles or how much content you include on every page).
es_es: <strong>El número de elementos del <abbr title="Document Object Model">DOM</abbr></strong> también es importante para determinar tu <abbr title="Search Engine Optimization">SEO</abbr> On page. Generalmente un número inferior indica que tu plantilla es mejor (aunque depende de cuantas noticias, artículos o la cantidad de contenido que incluyas en cada página).

source: Having <strong>a template ready form HTML5</strong> is an advantage. Nowadays the major number of modern browsers supports HTML5, this technology will help you to define your <strong>semantic layout</strong>. Thanks to this semantic, search engines can read better your content,
es_es: Tener un <strong>plantilla lista para HTML5</strong> es una ventaja. Hoy en día casi todos los navegadores modernos soportan HTML5. Esta tecnología te ayudará a definir <strong>una estructura semántica</strong> para tu página y gracias a esta semántica, los buscadores serán capaces de leer mejor tu contenido.

source: In <abbr title="HyperText Markup Language">HTML</abbr> language you can even <strong>specify the width and height of your images using attributes (height and width)</strong>. If you do, your browser will load faster your page because it won't need wait to load every image to know how to fit it at browser screen. The user experience (UX) will be improved, the bounce rate reduced and the <abbr title="Search Engine Optimization">SEO</abbr> on page better than ever.
es_es: En <abbr title="HyperText Markup Language">HTML</abbr> incluso puedes <strong>especificar el ancho y alto de tus imágenes con los atributos height y with de la etiqueta img.</strong>. Si lo haces, ayudarás al navegador a cargar más rápido tu página porqué así no será necesario a que este espere a cargar todas las imágenes para saber como encajarlas en la pantalla. La experiencia del usuario (UX) se verá mejorada, bajando así muy probablemente la tasa de rebote y al fin y al cabo mejorando el <abbr title="Search Engine Optimization">SEO</abbr> on page.

source: Finally it will be nice if your template will include a <strong><abbr title="Cascading Style Sheets">CSS</abbr> version for printing</strong>.
es_es: Finalmente estaría muy bien que tu plantilla incluyera <strong>una versión de <abbr title="Cascading Style Sheets">CSS</abbr> exclusiva para imprimir</strong>.

source: Will you include more SEO factors in future release?
es_es: ¿Incluirás más factores SEO en una próxima versión del plugin?

source: I want to check my tags, categories, author and other pages
es_es: Quiero comprobar las urls de categorías, etiquetas, autor y otras páginas

source: Actually <strong>Template SEO Checker</strong> checks about 17 factors to determine if your theme is <abbr title="Search Engine Optimization">SEO</abbr> friendly or not. In future releases more factors will be added and most kind of wordpress pages like (author, category, tag, error404, search, etc.) can be checked.<br />Depending on the success of this plugin (people using it), comments and donations received <strong>Template <abbr title="Search Engine Optimization">SEO</abbr> will be improved</strong>.
es_es: Actualmente, el plugin <strong>Template SEO Checker</strong> comprueba 17 factores seo para determinar si tu plantilla está bien optimizada para <abbr title="Search Engine Optimization">SEO</abbr> o no. En próximas versiones se añadirán nuevos factores y además se añadirá la posibilidad de comprobar otras páginas de tu plantilla como páginas de autor, de categorías, etiquetas, etc.<br />Dependiendo del éxito del plugin (personas que lo usen), comentarios recibidos así como las donaciones de la gente <strong>el plugin <strong>Template <abbr title="Search Engine Optimization">SEO</abbr> Checker será actualizado</strong>.

source: How can I thank you all your efforts?
es_es: ¿Como te puedo agradecer todo tu esfuerzo?

source: You can donate between $1,00 to $10,00 if you enjoyed this plugin. More options will be included on future releases.
es_es: Puedes donar entre 1 y 10&euro; si te ha sido de utilidad el plugin y quieres que se siga dando soporte en futuras versiones.

source: How you determine final score?
es_es: ¿Como se determina la puntuación final?

source: Based on my experience of <abbr title="Search Engine Optimization">SEO</abbr> manager I developed an algorithm who scraps your theme and check every factor defined in the plugin to know if your template is <abbr title="Search Engine Optimization">SEO</abbr> friendly. Then, foreach factor your theme gets an score and the sum of all of them determines the current URL score.
es_es: Basándome en mi experiencia cómo <abbr title="Search Engine Optimization">SEO</abbr> manager he desarrollado un algoritmo que escanea el contenido de tu plantilla y comprueba cada factor definido en el plugin para saber si tu plantilla está bien optimizada para <abbr title="Search Engine Optimization">SEO</abbr> o no. Entonces, para cada uno de ellos tu plantilla obtiene una puntuación, donde la suma determina finalmente la puntuación final de cada página.

source: What should I do if my wordpress template had a lower score?
es_es: ¿Qué debería hacer si mi plantilla de Wordpress tiene una puntuación baja en SEO?

source: If you don't care about <abbr title="Search Engine Optimization">SEO</abbr>, don't do anything. If you care about <abbr title="Search Engine Optimization">SEO</abbr> and you don't mind about your design you can try another wordpress theme. If you really like your current theme, you can try to fix the errors manually. And if you don't have the knowledge to fix the errors manually <strong>you can try to hire me</strong>.
es_es: Si te da absolutamente igual el <abbr title="Search Engine Optimization">SEO</abbr>, no hagas nada. Si te importa lo suficiente el <abbr title="Search Engine Optimization">SEO</abbr> y no te importa el diseño actual de tu web puedes probar otro tema de wordpress. Y si te gusta tu diseño actual puedes tratar de resolver manualmente los errores. Si no tienes el conocimiento adecuado para corregir estos errores manualmente siempre puedes <strong>tratar de contratarme</strong>.

source: Can I hire you to check and fix my wordpress site to be ready for <abbr title="Search Engine Optimization">SEO</abbr>?
es_es: ¿Puedo contratarte para comprobar y corregir la plantilla de mi web para optimiarla para <abbr title="Search Engine Optimization">SEO</abbr>?

source: <strong>Of course!</strong> You can contact me anytime writing me or following on <a href="https://plus.google.com/+JonatanJumbert" title="View Jonatan Jumbert's Google+ profile">Google+</a>, <a href="http://twitter.com/jonatanjumbert" title="View Jonatan Jumbert's Twitter profile">Twitter</a>, <a href="http://www.linkedin.com/pub/jonatan-jumbert-avil%C3%A9s/14/540/443" title="View Jonatan Jumbert's Linkedin profile">Linkedin</a>, <a href="https://www.facebook.com/jonatan.jumbert" title="View Jonatan Jumbert's Facebook profile">Facebook</a> or in <a href="http://jonatanjumbert.com/blog/?utm_source=Wordpress&utm_medium=Plugin&utm_term=Template%20SEO%20Checker&utm_campaign=Wordpress%20plugins" title="View Jonatan Jumbert's personal blog">my personal site</a>. Tell me about you and your site and let's see if we come to an agreement.
es_es: <strong>¡Pues claro!</strong> Puedes contactar conmigo en cualquier momento escribiéndome o siguiéndome en <a href="https://plus.google.com/+JonatanJumbert" title="Ver el perfil en Google+ de Jonatan Jumbert">Google+</a>, <a href="http://twitter.com/jonatanjumbert" title="Ver el perfil en Twitter de Jonatan Jumbert">Twitter</a>, <a href="http://www.linkedin.com/pub/jonatan-jumbert-avil%C3%A9s/14/540/443" title="Ver el perfil en Linkedin de Jonatan Jumbert">Linkedin</a>, <a href="https://www.facebook.com/jonatan.jumbert" title="Ver el perfil en Facebook de Jonatan Jumbert">Facebook</a> o en <a href="http://jonatanjumbert.com/blog/?utm_source=Wordpress&utm_medium=Plugin&utm_term=Template%20SEO%20Checker&utm_campaign=Wordpress%20plugins" title="Ver el blog de Jonatan Jumbert">mi página web personal</a>. Cuéntame sobre ti y tu proyecto y veamos si podemos llegar a un acuerdo.

source: <strong>Template SEO Checker</strong> have been updated your theme score.
es_es: <strong>Template SEO Checker</strong> ha actualizado la puntuación SEO de tu plantilla.

source: <strong>Template SEO Checker</strong> have been updated your homepage SEO score.
es_es: <strong>Template SEO Checker</strong> ha actualizado la puntuación SEO de la página principal.

source: <strong>Template SEO Checker</strong> have been updated your current URL SEO score.
es_es: <strong>Template SEO Checker</strong> ha actualizado la puntuación SEO de la URL analizada.

source: This action can take several seconds. Are you sure you want to continue?
es_es: Esta acción puede tardar varios segundos dependiendo de la velocidad de tu servidor y el tamaño de la URL a analizar. ¿Deseas continuar?

source: Close
es_es: Cerrar

source: Continue
es_es: Continuar

source: About the author
es_es: Sobre el autor
